export const mockupFirst = {
    showQuestionNumbers: "on",
    questions: [
        {
            type: "radiogroup",
            name: "1",
            title: "Вы пациент или родственник пациента?",
            isRequired: true,
            choices: [
                "Пациент", "Родственник"
            ],
            colCount: 0
        },
        {
            type: "radiogroup",
            name: "2",
            title: "Укажите Ваш пол",
            isRequired: true,
            choices: [
                "Мужчина", "Женщина"
            ],
            colCount: 0
        },
        {
            type: "radiogroup",
            name: "3",
            title: "Укажите свой возраст",
            isRequired: true,
            choices: [
                "18 – 24", "25 – 34","35 – 44","45 – 54","55 – 64","65 – 74","75 лет или старше"
            ],
            colCount: 0
        },
        {
            type: "radiogroup",
            name: "4",
            title: "Откуда вы узнали о ФГБУ «НМИЦ онкологии им. Н.Н. Петрова» Минздрава России (далее – НМИЦ)?",
            isRequired: true,
            hasOther: true,
            otherText: 'Другое',
            choices: [
                "Реклама (наружная)", "Интернет","Рекомендация знакомого","Телевидение"
            ],
            colCount: 0
        },
        {
            type: "radiogroup",
            name: "5",
            title: "Вы получили лечение",
            isRequired: true,
            choices: [
                "В дневном стационаре", "В круглосуточном стационаре"
            ],
            colCount: 0
        },
        {
            type: "radiogroup",
            name: "6",
            title: "Получили ли Вы приглашение на госпитализацию на бумажном носителе от врача НМИЦ и были ли Вам разъяснены правила (условия) госпитализации в НМИЦ?",
            isRequired: true,
            choices: [
                "Да", "Нет"
            ],
            colCount: 0
        },
        {
            type: "text",
            name: "7",
            title: "Укажите срок ожидания плановой госпитализации с момента получения направления на госпитализацию (количество дней)",
            isRequired: true,
            colCount: 0
        },
        {
            type: "radiogroup",
            name: "8",
            title: "До госпитализации Вам назначались диагностические исследования в НМИЦ?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет"
            ],
        },
        
        {
            type: "radiogroup",
            name: "9",
            title: "Имеете ли Вы установленную группу ограничения трудоспособности?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет"
            ],
        },
        {
            type: "radiogroup",
            name: "10",
            title: "Удовлетворены ли Вы условиями пребывания в приемном отделении?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет"
            ],
        },
        {
            type: "radiogroup",
            name: "11",
            title: "Что именно Вас не удовлетворяет?",
            isRequired: true,
            colCount: 0,
            hasOther: true,
            visibleIf: "{10}='Да'",
            otherText: 'Другое',
            choices: [
                "Отсутствие свободных мест ожидания", "Состояние гардероба","Состояние туалета","Отсутствие питьевой воды","Санитарные условия"
            ],
        },
        {
            type: "radiogroup",
            name: "12",
            title: "Сколько времени Вы провели в приемном отделении при госпитализации?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Более 2 часов", "От 1 до 2 часов","От 30 минут до часа","Менее 30 минут"
            ],
        },
        {
            type: "radiogroup",
            name: "13",
            title: "Удовлетворены ли Вы отношением персонала во время пребывания в приемном отделении (доброжелательность, вежливость)?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет"
            ],
        },
        {
            type: "radiogroup",
            name: "14",
            title: "Удовлетворены ли Вы навигацией внутри НМИЦ (предоставлением информации о размещении кабинетов медицинских работников, лабораторных и диагностических подразделений, санитарно-гигиенических помещений и др.)?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет"
            ],
        },
        {
            type: "radiogroup",
            name: "15",
            title: "Сколько времени Вы провели в ожидании Вашего лечащего врача после госпитализации в отделение?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Более 2 часов", "От 1 до 2 часов","От 30 минут до часа","Менее 30 минут"
            ],
        },
        {
            type: "radiogroup",
            name: "16",
            title: "Где Вы ожидали первичного осмотра лечащего врача?",
            isRequired: true,
            colCount: 0,
            otherText: 'Другое',
            choices: [
                "В коридоре", "В палате"
            ],
        },
        {
            type: "radiogroup",
            name: "17",
            title: "Кто проводил Ваш первичный осмотр?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Ваш лечащий врач", "Помощник врача (ординатор)","Дежурный врач","Врач не представился"
            ],
        },
        {
                type: "html",
                name: "info",
                html: "<h3>Оцените от 1 до 10 работу Вашего врача</h3>"
            
        },
        {
            type: "rating",
            name: "19",
            title: "Вас внимательно выслушали",
            rateValues:['1','2','3','4','5','6','7','8','9','10'],
            minRateDescription: "Не удовлетворены",
            maxRateDescription: "Удовлеторены"
        },
        {
            type: "rating",
            name: "20",
            title: "Вам ответили на все Ваши вопросы",
            rateValues:['1','2','3','4','5','6','7','8','9','10'],
            minRateDescription: "Не удовлетворены",
            maxRateDescription: "Удовлеторены"
        },
        {
            type: "rating",
            name: "21",
            title: "Вашей проблеме уделили должное внимание",
            rateValues:['1','2','3','4','5','6','7','8','9','10'],
            minRateDescription: "Не удовлетворены",
            maxRateDescription: "Удовлеторены"
        },
        {
            type: "rating",
            name: "22",
            title: "Врач был учтив и вежлив",
            rateValues:['1','2','3','4','5','6','7','8','9','10'],
            minRateDescription: "Не удовлетворены",
            maxRateDescription: "Удовлеторены"
        },
        {
            type: "radiogroup",
            name: "23",
            title: "Какое лечение Вам проводилось?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Оперативное (хирургическое)", "Лекарственное","Лучевая терапия"
            ],
        },
        {
            type: "radiogroup",
            name: "24",
            title: "Возникала ли у Вас во время пребывания в стационаре необходимость оплачивать назначенные лекарственные средства за свой счет?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет"
            ],
        },
        {
            type: "text",
            name: "25",
            title: "Сколько времени продлилась Ваша госпитализация?",
            isRequired: true,
            colCount: 0,
        },
        {
            type: "radiogroup",
            name: "26",
            title: "После выписки врач объяснил Вам свои рекомендации?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет","Частично","Только после Вашей просьбы"
            ],
        },
        {
            type: "rating",
            name: "27",
            title: "Насколько Вы удовлетворены качеством выполнения обязанностей младшим медицинским персоналом Вашего отделения (санитарки, буфетчицы)?",
            rateValues:['1','2','3','4','5','6','7','8','9','10'],
            minRateDescription: "Не удовлетворены",
            maxRateDescription: "Удовлеторены"
        },
        {
            type: "rating",
            name: "28",
            title: "Насколько Вы удовлетворены работой среднего медицинского персонала отделения (медицинские сестры)?",
            rateValues:['1','2','3','4','5','6','7','8','9','10'],
            minRateDescription: "Не удовлетворены",
            maxRateDescription: "Удовлеторены"
        },
        {
            type: "rating",
            name: "29",
            title: "Насколько Вы удовлетворены отношением к Вам персонала отделения (культура общения, внимание, доброжелательность, ответы на Ваши вопросы)?",
            rateValues:['1','2','3','4','5','6','7','8','9','10'],
            minRateDescription: "Не удовлетворены",
            maxRateDescription: "Удовлеторены"
        },
        {
            type: "rating",
            name: "30",
            title: "Насколько Вы удовлетворены питанием во время пребывания в НМИЦ?",
            rateValues:['1','2','3','4','5','6','7','8','9','10'],
            minRateDescription: "Не удовлетворены",
            maxRateDescription: "Удовлеторены"
        },
        {
            type: "radiogroup",
            name: "31",
            title: "Сколько раз в день проводилась уборка Вашей палаты?",
            isRequired: true,
            choices: [
                "Не проводилась", "1 раз в день","Более 1 раза в день","Затрудняюсь ответить"
            ],
            colCount: 0
        },
        {
            type: "radiogroup",
            name: "32",
            title: "Проводится ли обработка тумбочек в Вашей палате?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет","Затрудняюсь ответить"
            ],
        },
        {
            type: "radiogroup",
            name: "33",
            title: "Были ли отмечены по отношению к Вам нарушения этики (грубость, невежливое обращение) со стороны медицинского персонала?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет"
            ],
        },
        {
            type: "radiogroup",
            name: "34",
            title: "Случались ли конфликтные ситуации в отделении?",
            isRequired: true,
            choices: [
                "Да", "Нет"
            ],
            colCount: 0
        },
        {
            type: "rating",
            name: "35",
            title: "Отметьте, насколько Вы удовлетворены оказанной медицинской помощью в НМИЦ",
            rateValues:['1','2','3','4','5','6','7','8','9','10'],
            minRateDescription: "Не удовлетворены",
            maxRateDescription: "Удовлеторены"
        },
        {
            type: "radiogroup",
            name: "36",
            title: "Сколько времени Вы ожидали проведения исследования",
            isRequired: true,
            colCount: 0,
            choices: [
                "14 календарных дней и более", "От 7 до 14 дней","Менее 7 дней"
            ],
        },
        {
            type: "radiogroup",
            name: "37",
            title: "Исследование проведено в дату и время, установленные при записи?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет"
            ],
        },
        {
            type: "radiogroup",
            name: "38",
            title: "Какая у Вас установлена группа инвалидности?",
            isRequired: true,
            colCount: 0,
            choices: [
                "I", "II","III"
            ],
        },
        {
            type: "radiogroup",
            name: "38",
            title: "По Вашему мнению, оборудован ли НМИЦ всем необходимым для доступа лиц с ограниченными возможностями?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет"
            ],
        },
        {
            type: "checkbox",
            name: "39",
            title: "Отметьте, чего не хватает для комфортного пребывания пациентов с ограниченными возможностями?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Специального подъезда и парковки для автотранспорта", "Пандусов, поручней","Электрических подъемников","Специальных лифтов","Голосовых сигналов","Информационных бегущих строк, информационных стендов","Информации для слабовидящих людей шрифтом Брайля","Специально оборудованных санитарно-гигиенических помещений","Сменных кресел-колясок"
            ],
        },
        {
            type: "radiogroup",
            name: "40",
            title: "Объяснил ли Вам врач цель и риски операции, а также ход операции?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет"
            ],
        },
        {
            type: "radiogroup",
            name: "41",
            title: "Во время осмотра анестезиологом всё ли Вам было разъяснено?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет"
            ],
        },
        {
            type: "radiogroup",
            name: "42",
            title: "Находились ли Вы в реанимации после оперативного вмешательства?",
            isRequired: true,
            colCount: 0,
            choices: [
                "Да", "Нет"
            ],
        },
        {
            type: "rating",
            name: "43   ",
            title: "Как Вы оцениваете работу специалистов реанимационного отделения?",
            rateValues:['1','2','3','4','5','6','7','8','9','10'],
            minRateDescription: "Не удовлетворены",
            maxRateDescription: "Удовлеторены"
        },

    ]
}

